In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [3]:
%sql sqlite:///HW11.db

# Practice task 1: Please, produce the First, Second and Third Normal Form of this document by normalization.

In [14]:
%%sql
Create Table Orderform
(OrderNo int,
Custnum int,
Custname char(15),
Custadress char(30),
Citycountry char(30),
ProductNo char(4),
Description char(20),
Quantity int,
Price int,
Date date
);

   sqlite://
 * sqlite:///HW11.db
Done.

[]

In [19]:
%%sql
Insert into Orderform (OrderNo, Custnum, Custname, Custadress, Citycountry, ProductNo, Description, Quantity, Price, Date)
Values (1234, 1000, 'Billy','457 park drive, apt.1', 'Boston, USA', 'A123', 'Pencil', 100, 1.3, '30-08-2019'),
(1234, 1000, 'Billy','457 park drive, apt.1', 'Boston, USA', 'B234', 'Eraser', 250, 30, '30-08-2019'),
(1234, 1000, 'Billy','457 park drive, apt.1', 'Boston, USA', 'A123', 'Sharpener', 9, 120, '30-08-2019' );

   sqlite://
 * sqlite:///HW11.db
3 rows affected.

[]

In [20]:
%%sql
select * from Orderform;

   sqlite://
 * sqlite:///HW11.db
Done.

[(1234, 1000, 'Billy', '457 park drive, apt.1', 'Boston, USA', 'A123', 'Pencil', 100, 1.3, '30-08-2019'),
 (1234, 1000, 'Billy', '457 park drive, apt.1', 'Boston, USA', 'B234', 'Eraser', 250, 30, '30-08-2019'),
 (1234, 1000, 'Billy', '457 park drive, apt.1', 'Boston, USA', 'A123', 'Sharpener', 9, 120, '30-08-2019')]

In [21]:
# 1 NF we should devide city and country into two row

In [23]:
# 2NF no partial dependencies (devide a table)

In [29]:
%%sql
select productno, description, price from Orderform;

   sqlite://
 * sqlite:///HW11.db
Done.

[('A123', 'Pencil', 1.3), ('B234', 'Eraser', 30), ('A123', 'Sharpener', 120)]

In [32]:
%%sql
select Custnum, Custname, Custadress, citycountry from Orderform;

   sqlite://
 * sqlite:///HW11.db
Done.

[(1000, 'Billy', '457 park drive, apt.1', 'Boston, USA'),
 (1000, 'Billy', '457 park drive, apt.1', 'Boston, USA'),
 (1000, 'Billy', '457 park drive, apt.1', 'Boston, USA')]

In [33]:
%%sql
select Custnum, productno, quantity from Orderform;

   sqlite://
 * sqlite:///HW11.db
Done.

[(1000, 'A123', 100), (1000, 'B234', 250), (1000, 'A123', 9)]

# Practice task 2: Please, produce the First, Second and Third Normal Form for the given table.

In [36]:
%%sql
CREATE TABLE second_task (
pet_id int,
pet_name varchar,
pet_type varchar,
pet_age int,
owner_name varchar,
visit_date date,
pet_procedure text,
PRIMARY KEY(pet_id));

   sqlite://
 * sqlite:///HW11.db
(sqlite3.OperationalError) table second_task already exists
[SQL: CREATE TABLE second_task (
pet_id int,
pet_name varchar,
pet_type varchar,
pet_age int,
owner_name varchar,
visit_date date,
pet_procedure text,
PRIMARY KEY(pet_id));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [38]:
%%sql
INSERT INTO second_task (pet_id, pet_name, pet_type, pet_age, owner_name, visit_date, pet_procedure)
VALUES (246, 'Rover', 'Dog', 12, 'Sam Cook', '13-01-2015, 27-03-2016, 02-04-2017', '01-Rabies vaccination, 10-Examine and treat wound,05-Heart worm test') ,
(298, 'Spot', 'Dog', 2, 'Terry Kim', '21-01-2012, 10-03-2018', '08-Tetanus vaccination, 05-Heart worm test') ,
(519, 'Tweedy', 'Bird', 2, 'Terry Kim', '30-04-2002', '20-Annual check up');

   sqlite://
 * sqlite:///HW11.db
3 rows affected.

[]

In [39]:
%%sql 
select * from second_task

   sqlite://
 * sqlite:///HW11.db
Done.

[(246, 'Rover', 'Dog', 12, 'Sam Cook', '13-01-2015, 27-03-2016, 02-04-2017', '01-Rabies vaccination, 10-Examine and treat wound,05-Heart worm test'),
 (298, 'Spot', 'Dog', 2, 'Terry Kim', '21-01-2012, 10-03-2018', '08-Tetanus vaccination, 05-Heart worm test'),
 (519, 'Tweedy', 'Bird', 2, 'Terry Kim', '30-04-2002', '20-Annual check up')]

1NF we devide owner_name into owner_name and owner_lastname, and pet_procedures into proc_id and proc_name

2 NF 1 table we have pet_id and visit_id as PK and colmns named pet_name, pet_type, pet_age, owner_name, owner_lastname, visit_day
and table proc_id where get proc_name

3 NF 
pet_id as PK and clmns pet_type pet_name, owner                                        
and second table pet_id, visit_date as PK where as result we get visited date

# Practice task 3: Please, produce the First, Second and Third Normal Form for the given data.

In [53]:
%%sql
Create Table Invoicet
(invoiceno int,
Vet char(30),
Adress char(30),
Citycountry char(30),
Date date,
ProductNo char(6),
pet char(15),
procedure char(20),
amount float
);

   sqlite://
 * sqlite:///HW11.db
Done.

[]

In [55]:
%%sql
insert into Invoicet(invoiceno,Vet,Adress,Citycountry, Date,ProductNo,pet, procedure, amount)
values (185, 'MR.RICHARD GRAY','123 THIS STREET', 'My City Ontaro','13-01-2019', 'Z5Z6G6', 'ready', 'rabbies vaccination', 30.00),
(185, 'MR.RICHARD GRAY','123 THIS STREET', 'My City Ontaro','13-01-2019', 'Z5Z6G6', 'brown', 'rabbies vaccination', 24.0);

   sqlite://
 * sqlite:///HW11.db
2 rows affected.

[]

In [56]:
%%sql
select * from invoicet

   sqlite://
 * sqlite:///HW11.db
Done.

[(185, 'MR.RICHARD GRAY', '123 THIS STREET', 'My City Ontaro', '13-01-2019', 'Z5Z6G6', 'ready', 'rabbies vaccination', 30.0),
 (185, 'MR.RICHARD GRAY', '123 THIS STREET', 'My City Ontaro', '13-01-2019', 'Z5Z6G6', 'brown', 'rabbies vaccination', 24.0)]

1 NF we will add pet_id attribute and choose it as PK
and devide citycountry column to city and country separetly

2 NF Identify all functional dependencies

3 NF there are 4 tables lets list them                                                 
*invoice table contain  invoiceno, date, vet(FK)                                   
*cost of procedure table contain invoiceno, pet_id, procedure                             
*pet table contain pet_id, pet                                             
*customer info contain vetno, vet, adress, city, country

# Practice task 4: Please, produce the First, Second and Third Normal Form for the given data.

In [70]:
%%sql
Create Table Customerhist
(custno char(6),
cust_name char(30),
cust_addr char(30),
countrycity char(30),
cust_phone char(30),
artist char(30),
title char(30),
pur_date date,
sales float
);

   sqlite://
 * sqlite:///HW11.db
Done.

[]

In [71]:
%%sql
insert into Customerhist (custno, cust_name, cust_addr, countrycity, cust_phone, artist, title,pur_date, sales)
values ('L3J4S4','Markl, Meghan', '123-4th Avenue', 'London, UK', '+1(206)286-6783', '03-Bob Channing', 'Laugh with Teeth', '09-17-2019', 7000.00),
('L3J4S4','Markl, Meghan', '123-4th Avenue', 'London, UK', '+1(206)286-6783','03-Bob Channing', 'At the Movies', '02-14-2017', 5550.00),
('L3J4S4','Markl, Meghan', '123-4th Avenue', 'London, UK', '+1(206)286-6783','15-Dennis Frings', 'South toward Emerald Sea', '07-15-2018', 2200.00);

   sqlite://
 * sqlite:///HW11.db
3 rows affected.

[]

In [72]:
%%sql
select * from Customerhist

   sqlite://
 * sqlite:///HW11.db
Done.

[('L3J4S4', 'Markl, Meghan', '123-4th Avenue', 'London, UK', '+1(206)286-6783', '03-Bob Channing', 'Laugh with Teeth', '09-17-2019', 7000.0),
 ('L3J4S4', 'Markl, Meghan', '123-4th Avenue', 'London, UK', '+1(206)286-6783', '03-Bob Channing', 'At the Movies', '02-14-2017', 5550.0),
 ('L3J4S4', 'Markl, Meghan', '123-4th Avenue', 'London, UK', '+1(206)286-6783', '15-Dennis Frings', 'South toward Emerald Sea', '07-15-2018', 2200.0)]

1 NF devide cust_name into                                  
countrycity into country and city

2 NF check dependencies

3 NF 
customer(custno, first_name, last_name, street, city, state)                       
artist info (id, artist_name)                        
product (Id, artist_id, title, sales)                
purchase (ID, cust_no, date)

# Practice task 5: Please, answer the given questions below. Produce the normalization forms if itâ€™s applicable.

a) we need to find the key for player.                                 
As the key (Player-no) is single and simple attribute, there is no possibilities for partial-key dependencies. Hence, PLAYER is in 2NF.

b) we need to check for non-key dependencies or transitive dependencies                        
PLAYER (Player-no, Player-name, Player-position, Team)                              
TEAM (Team, Team-color, Team-captain, Coach-no)                        
COACH (Coach-no, Coach-name)

# Practice task 6: The following table is already in first normal form (1NF). There is only one entry per field. Please convert this table to the third normal form (3NF) using the techniques you learned in this chapter.

In [77]:
%%sql
Create Table Class
(UnitID char(2),
 StudentID char(3),
 Date date,
 TutorID char(3),
 Topic char(3),
 Room int, 
 Grade float,
 Book char(20),
 TutorEmail char(12)
);

   sqlite://
 * sqlite:///HW11.db
Done.

[]

In [79]:
%%sql
insert into Class (UnitID, StudentID, Date, TutorID, Topic, Room, Grade, Book, TutorEmail)
values ('U1', 'St1', '23-02-03', 'Tut1', 'GMT', 629, 4.7, 'Deumlich', 'tut1@bu.edu');

   sqlite://
 * sqlite:///HW11.db
1 rows affected.

[]

In [80]:
%%sql
select * from Class

   sqlite://
 * sqlite:///HW11.db
Done.

[('U1', 'St1', '23-02-03', 'Tut1', 'GMT', 629, 4.7, 'Deumlich', 'tut1@bu.edu')]

In [81]:
# 3NF saved on word file in my desktop

3 NF 

units table contain UnitID, Topic,                                      
books contain Book, UnitID,               
lesson contain Room, Date, TutorID,                             
titor info contain TutorID, TutorEmail,                       
student table contain StudentID, Grade, TutorID

# Practice task 7: An agency called Hilton Garden supplies part-time/temporary staff to hotels in USA. 
Table below lists the time spent by agency staff working at various hotels. The social security number (SSN) is unique for every member of staff.
Use the data given in the table below to answer questions (a) and (b).
a. This table is susceptible to update anomalies. Provide examples of insertion, deletion and update anomalies.
b. Normalize this table to third normal form.

# Practice task 8: Please, produce the Second and Third Normal Form for the given table.